IDEA StatiCa Open Model
CrossSectionFactory.FillSteelTube Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill steel tube
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillSteelTube(
	CrossSectionParameter cssO,
	double r,
	double t
)
Public Shared Sub FillSteelTube (
	cssO As CrossSectionParameter,
	r As Double,
	t As Double
)
public:
static void FillSteelTube(
	CrossSectionParameter^ cssO,
	double r,
	double t
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
r
Type: System.Double
The radius of circle.
t
Type: System.Double
The thickness of wall.
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace